bookers2-debug/app/views/books/index.html.erb

								<i class="glyphicon glyphicon-heart" aria-hidden="true"></i>
								<%= book.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]

								<i class="glyphicon glyphicon-heart" aria-hidden="true"></i>
								<%= book.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

						<td>コメント数：
							<%= book.book_comments.count %>
---
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]