bookers2-debug/app/views/books/show.html.erb

								<i class="glyphicon glyphicon-heart" aria-hidden="true" style="color: red;"></i>
								<%= @book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 3]]

								<i class="glyphicon glyphicon-heart" aria-hidden="true"></i>
								<%= @book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]

						<td>コメント数：
							<a href="#comments"><%= @book.book_comments.count %></a>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]

					</tr>
						<% @book.book_comments.each do |book_comment| %>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]