bookers2-debug/app/views/users/show.html.erb

								<i class="glyphicon glyphicon-heart" aria-hidden="true" style="color: red;"></i>
								<%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]

								<i class="glyphicon glyphicon-heart" aria-hidden="true"></i>
								<%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 3]]

						<td>コメント数：
							<a href="#comments"><%= @book.book_comments.count %></a>
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]