bookers2-debug/app/controllers/book_comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "a"], ["user_id", 1], ["book_id", 1], ["created_at", "2020-05-04 09:58:24.071684"], ["updated_at", "2020-05-04 09:58:24.071684"]]
---
	def create
		book = Book.find(params[:book_id])
		book_comment = current_user.book_comments.new(book_comment_params)
		book_comment.book_id = book.id
		if book_comment.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."user_id" = ? AND "book_comments"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 1]]
---
	def destroy
		book = Book.find(params[:book_id])
		book_comment = current_user.book_comments.find(params[:id])
		book_comment.destroy