bookers2-debug/app/controllers/books_controller.rb

  def create
  	@book = Book.new(book_params) #Bookモデルのテーブルを使用しているのでbookコントローラで保存する。
  	@book.user = current_user
    if @book.save #入力されたデータをdbに保存する。
      redirect_to book_path(@book), notice: "successfully created book!"#保存された場合の移動先を指定。
  	else
  		@books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "a"], ["body", "aa"], ["user_id", 3], ["created_at", "2020-05-03 02:58:25.595674"], ["updated_at", "2020-05-03 02:58:25.595674"]]
SELECT "books".* FROM "books"