bookers2-debug/app/controllers/relationships_controller.rb

	def set_user
		@user = User.find(params[:follow_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]